"{\"class_name\": \"Tokenizer\", \"config\": {\"num_words\": 50000, \"filters\": \"!\\\"#$%&()*+,-./:;<=>?@[\\\\]^_`{|}~\\t\\n'\", \"lower\": true, \"split\": \" \", \"char_level\": false, \"oov_token\": null, \"document_count\": 1105, \"word_counts\": \"{\\\"tr\\\\u00ed\\\": 130, \\\"th\\\\u00f4ng\\\": 180, \\\"minh\\\": 100, \\\"nh\\\\u00e2n\\\": 163, \\\"t\\\\u1ea1o\\\": 206, \\\"c\\\\u00f3\\\": 909, \\\"ngh\\\\u0129a\\\": 67, \\\"r\\\\u1ed9ng\\\": 84, \\\"nh\\\\u01b0\\\": 274, \\\"l\\\\u00e0\\\": 988, \\\"trong\\\": 673, \\\"nh\\\\u1eefng\\\\u00a0t\\\\u00e1c\\\": 1, \\\"ph\\\\u1ea9m\\\\u00a0khoa\\\": 1, \\\"h\\\\u1ecdc\\\": 233, \\\"vi\\\\u1ec5n\\\": 1, \\\"t\\\\u01b0\\\\u1edfng\\\": 8, \\\"n\\\\u00f3\\\": 19, \\\"m\\\\u1ed9t\\\": 605, \\\"nh\\\\u1eefng\\\": 191, \\\"ng\\\\u00e0nh\\\": 12, \\\"quan\\\": 155, \\\"v\\\\u00e0\\\": 675, \\\"ch\\\\u1ee7\\\": 13, \\\"y\\\\u1ebfu\\\\u00a0c\\\\u1ee7a\\\\u00a0tin\\\": 1, \\\"t\\\\u1ea1o\\\\u00a0li\\\\u00ean\\\": 1, \\\"\\\\u0111\\\\u1ebfn\\\": 45, \\\"c\\\\u00e1ch\\\": 267, \\\"c\\\\u01b0\\\": 2, \\\"x\\\\u1eed\\\": 33, \\\"s\\\\u1ef1\\\": 64, \\\"h\\\\u1ecfi\\\": 51, \\\"\\\\u00a0kh\\\\u1ea3\\\": 1, \\\"n\\\\u0103ng\\\": 92, \\\"th\\\\u00edch\\\": 53, \\\"\\\\u1ee9ng\\\": 111, \\\"c\\\\u1ee7a\\\": 639, \\\"m\\\\u00e1y\\\": 164, \\\"m\\\\u00f3c\\\": 11, \\\"nhi\\\\u1ec1u\\\": 220, \\\"\\\\u0111i\\\\u1ec3m\\\": 75, \\\"kh\\\\u00e1c\\\": 139, \\\"nhau\\\": 116, \\\"v\\\\u1ec1\\\": 114, \\\"tu\\\\u1ec7\\\": 113, \\\"do\\\": 187, \\\"v\\\\u1eady\\\": 134, \\\"\\\\u0111\\\\u1ecbnh\\\": 273, \\\"l\\\\u0129nh\\\": 36, \\\"v\\\\u1ef1c\\\": 37, \\\"khoa\\\": 19, \\\"n\\\\u00e0y\\\": 202, \\\"trong\\\\u00a0khoa\\\": 1, \\\"t\\\\u00ednh\\\": 480, \\\"\\\\u00a0tr\\\\u00ed\\\": 1, \\\"t\\\\u1ea1o\\\\u00a0hay\\\\u00a0ai\\\\u00a0\\\": 1, \\\"ti\\\\u1ebfng\\\": 29, \\\"anh\\\": 16, \\\"\\\\u00a0artificial\\\": 1, \\\"intelligence\\\": 5, \\\"\\\\u0111\\\\u00f4i\\\": 6, \\\"khi\\\": 262, \\\"\\\\u0111\\\\u01b0\\\\u1ee3c\\\": 746, \\\"g\\\\u1ecdi\\\": 135, \\\"l\\\\u00e0\\\\u00a0tr\\\\u00ed\\\": 3, \\\"minh\\\\u00a0\\\\u0111\\\\u01b0\\\\u1ee3c\\\": 1, \\\"th\\\\u1ec3\\\": 557, \\\"hi\\\\u1ec7n\\\": 250, \\\"b\\\\u1eb1ng\\\\u00a0m\\\\u00e1y\\\": 1, \\\"tr\\\\u00e1i\\\": 11, \\\"ng\\\\u01b0\\\\u1ee3c\\\": 33, \\\"v\\\\u1edbi\\\\u00a0tr\\\\u00ed\\\": 1, \\\"t\\\\u1ef1\\\": 208, \\\"nhi\\\\u00ean\\\\u00a0c\\\\u1ee7a\\\": 1, \\\"con\\\": 132, \\\"ng\\\\u01b0\\\\u1eddi\\\": 155, \\\"th\\\\u01b0\\\\u1eddng\\\": 103, \\\"thu\\\\u1eadt\\\": 350, \\\"ng\\\\u1eef\\\": 103, \\\"s\\\\u1eed\\\": 305, \\\"d\\\\u1ee5ng\\\": 372, \\\"\\\\u0111\\\\u1ec3\\\": 310, \\\"m\\\\u00f4\\\": 124, \\\"t\\\\u1ea3\\\": 16, \\\"c\\\\u00e1c\\\": 924, \\\"ho\\\\u1eb7c\\\": 136, \\\"kh\\\\u1ea3\\\": 90, \\\"b\\\\u1eaft\\\": 21, \\\"ch\\\\u01b0\\\\u1edbc\\\": 2, \\\"ch\\\\u1ee9c\\\": 6, \\\"nh\\\\u1eadn\\\": 145, \\\"th\\\\u1ee9c\\\": 241, \\\"m\\\\u00e0\\\": 61, \\\"ph\\\\u1ea3i\\\": 62, \\\"li\\\\u00ean\\\": 52, \\\"k\\\\u1ebft\\\": 149, \\\"v\\\\u1edbi\\\\u00a0t\\\\u00e2m\\\": 1, \\\"t\\\\u1eadp\\\": 245, \\\"gi\\\\u1ea3i\\\": 230, \\\"quy\\\\u1ebft\\\": 119, \\\"v\\\\u1ea5n\\\": 62, \\\"\\\\u0111\\\\u1ec1\\\": 105, \\\"ng\\\\u00e0y\\\": 9, \\\"c\\\\u00e0ng\\\": 28, \\\"t\\\\u0103ng\\\": 49, \\\"nhi\\\\u1ec7m\\\": 5, \\\"v\\\\u1ee5\\\": 11, \\\"coi\\\": 26, \\\"c\\\\u1ea7n\\\": 168, \\\"b\\\\u1ecb\\\": 43, \\\"lo\\\\u1ea1i\\\": 278, \\\"b\\\\u1ecf\\\": 32, \\\"kh\\\\u1ecfi\\\": 16, \\\"ai\\\": 59, \\\"t\\\\u01b0\\\\u1ee3ng\\\": 59, \\\"l\\\\u00e0\\\\u00a0hi\\\\u1ec7u\\\": 1, \\\"t\\\\u1ea1o\\\\u00a0hay\\\\u00a0tr\\\\u00ed\\\": 1, \\\"artificial\\\": 6, \\\"intelligence\\\\u00a0\\\\u2013\\\": 4, \\\"vi\\\\u1ebft\\\": 32, \\\"t\\\\u1eaft\\\": 15, \\\"\\\\u00a0l\\\\u00e0\\\": 2, \\\"thu\\\\u1ed9c\\\": 163, \\\"t\\\\u00ednh\\\\u00a0\\\": 1, \\\"computer\\\": 5, \\\"science\\\": 4, \\\"l\\\\u1eadp\\\": 109, \\\"tr\\\\u00ecnh\\\": 145, \\\"n\\\\u00ean\\\": 29, \\\"v\\\\u1edbi\\\": 460, \\\"m\\\\u1ee5c\\\": 65, \\\"ti\\\\u00eau\\\": 63, \\\"gi\\\\u00fap\\\\u00a0m\\\\u00e1y\\\": 1, \\\"\\\\u0111\\\\u1ed9ng\\\": 158, \\\"h\\\\u00f3a\\\": 40, \\\"h\\\\u00e0nh\\\": 74, \\\"vi\\\": 28, \\\"gi\\\\u00fap\\\": 14, \\\"bi\\\\u1ebft\\\": 51, \\\"suy\\\": 231, \\\"ngh\\\\u0129\\\": 22, \\\"lu\\\\u1eadn\\\": 68, \\\"giao\\\": 10, \\\"ti\\\\u1ebfp\\\": 59, \\\"hi\\\\u1ec3u\\\": 23, \\\"ng\\\\u00f4n\\\": 66, \\\"n\\\\u00f3i\\\": 61, \\\"nghi\\\": 34, \\\"\\\\u2026\\\": 40, \\\"\\\\u00a0ai\\\\u00a0\\\": 1, \\\"\\\\u00a0ho\\\\u1eb7c\\\": 1, \\\"c\\\\u00f4ng\\\": 121, \\\"ngh\\\\u1ec7\\\": 16, \\\"ph\\\\u1ecfng\\\": 13, \\\"qu\\\\u00e1\\\": 98, \\\"cho\\\": 449, \\\"\\\\u0111\\\\u1eb7c\\\": 90, \\\"bi\\\\u1ec7t\\\": 19, \\\"h\\\\u1ec7\\\": 250, \\\"th\\\\u1ed1ng\\\": 185, \\\"ra\\\": 315, \\\"\\\\u0111\\\\u00edch\\\": 103, \\\"t\\\\u1eeb\\\": 255, \\\"\\\\u0111\\\\u00f3\\\": 329, \\\"c\\\\u1eaft\\\": 11, \\\"gi\\\\u1ea3m\\\": 45, \\\"b\\\\u1edbt\\\": 5, \\\"chu\\\\u1ea9n\\\": 18, \\\"x\\\\u00e1c\\\": 444, \\\"cao\\\": 50, \\\"h\\\\u01a1n\\\": 169, \\\"so\\\": 40, \\\"logic\\\": 133, \\\"tr\\\\u01b0\\\\u1edbc\\\": 72, \\\"kia\\\": 7, \\\"ch\\\\u00ednh\\\": 123, \\\"\\\\u0111\\\\u1ed9c\\\": 32, \\\"ch\\\\u00fang\\\": 18, \\\"thay\\\": 90, \\\"v\\\\u00ec\\\": 38, \\\"vi\\\\u1ec7c\\\": 176, \\\"m\\\\u1ecdi\\\": 52, \\\"th\\\\u1ee9\\\": 97, \\\"s\\\\u1eb5n\\\": 3, \\\"c\\\\u1ed7\\\": 1, \\\"s\\\\u1ebd\\\": 111, \\\"th\\\\u1ef1c\\\": 201, \\\"thao\\\": 14, \\\"t\\\\u00e1c\\\": 18, \\\"theo\\\": 242, \\\"\\\\u0111\\\\u1eb7t\\\": 17, \\\"\\\\u00a0ai\\\": 2, \\\"t\\\\u1ea1o\\\\u00a0s\\\\u1ebd\\\": 1, \\\"xem\\\": 38, \\\"x\\\\u00e9t\\\": 46, \\\"t\\\\u00ecnh\\\": 10, \\\"hu\\\\u1ed1ng\\\": 9, \\\"\\\\u0111\\\\u01b0a\\\": 19, \\\"ph\\\\u01b0\\\\u01a1ng\\\": 177, \\\"\\\\u00e1n\\\": 18, \\\"t\\\\u1ed1i\\\": 102, \\\"\\\\u01b0u\\\": 114, \\\"nh\\\\u1ea5t\\\": 243, \\\"qua\\\": 37, \\\"ti\\\\u1ebft\\\": 4, \\\"ki\\\\u1ec7m\\\": 1, \\\"chi\\\": 8, \\\"ph\\\\u00ed\\\": 7, \\\"c\\\\u0169ng\\\": 61, \\\"v\\\\u1eadn\\\": 2, \\\"hi\\\\u1ec7u\\\": 110, \\\"qu\\\\u1ea3\\\": 108, \\\"machine\\\": 2, \\\"b\\\\u1ea1n\\\": 3, \\\"c\\\\u1ea5u\\\": 23, \\\"h\\\\u00ecnh\\\": 123, \\\"ph\\\\u00f9\\\": 26, \\\"h\\\\u1ee3p\\\": 305, \\\"\\\\u0111\\\\u1ea7u\\\": 176, \\\"ph\\\\u1ea7n\\\": 71, \\\"m\\\\u1ec1m\\\": 7, \\\"to\\\\u00e1n\\\": 527, \\\"training\\\": 1, \\\"hu\\\\u1ea5n\\\": 114, \\\"luy\\\\u1ec7n\\\": 115, \\\"c\\\\u1ee5\\\": 74, \\\"d\\\\u01b0\\\\u1edbi\\\": 59, \\\"\\\\u0111\\\\u00e2y\\\": 62, \\\"thu\\\": 21, \\\"th\\\\u1eadp\\\": 14, \\\"tin\\\": 105, \\\"quy\\\": 115, \\\"t\\\\u1eafc\\\": 73, \\\"\\\\u0111\\\\u1ea1t\\\": 37, \\\"g\\\\u1ea7n\\\": 37, \\\"\\\\u0111\\\\u00fang\\\": 86, \\\"s\\\\u1eeda\\\": 1, \\\"l\\\\u1ed7i\\\": 22, \\\"ai\\\\u00a0hay\\\": 1, \\\"t\\\\u1ea1o\\\\u00a0\\\": 1, \\\"l\\\\u00e0\\\\u00a0ai\\\": 1, \\\"nh\\\\u1eb1m\\\": 7, \\\"h\\\\u01b0\\\\u1edbng\\\": 44, \\\"t\\\\u1edbi\\\": 153, \\\"\\\\u0111\\\\u00edch\\\\u00a0\\\\u0111\\\\u1ec3\\\": 1, \\\"ho\\\\u00e1\\\": 27, \\\"l\\\\u00ed\\\": 1, \\\"d\\\\u1eef\\\": 153, \\\"li\\\\u1ec7u\\\": 157, \\\"nhanh\\\": 18, \\\"b\\\\u1ed9\\\": 132, \\\"ph\\\\u1eadn\\\": 1, \\\"tr\\\\u00ean\\\": 274, \\\"nguy\\\\u00ean\\\": 69, \\\"l\\\\u00fd\\\": 114, \\\"thuy\\\\u1ebft\\\": 16, \\\"v\\\\u1eefng\\\": 3, \\\"ch\\\\u1eafc\\\": 10, \\\"chia\\\": 43, \\\"th\\\\u00e0nh\\\": 158, \\\"04\\\": 1, \\\"c\\\\u1ea5p\\\": 25, \\\"\\\\u0111\\\\u1ed9\\\": 270, \\\"ph\\\\u1ea3n\\\": 13, \\\"reactive\\\": 1, \\\"machines\\\": 3, \\\"nh\\\\u1edb\\\": 44, \\\"gi\\\\u1edbi\\\": 42, \\\"h\\\\u1ea1n\\\": 90, \\\"limited\\\": 1, \\\"memory\\\": 2, \\\"g\\\\u1eafn\\\": 4, \\\"t\\\\u00e2m\\\": 30, \\\"theory\\\": 2, \\\"of\\\": 5, \\\"mind\\\": 1, \\\"self\\\": 1, \\\"awareness\\\": 1, \\\"t\\\\u01b0\\\": 10, \\\"duy\\\": 20, \\\"\\\\u2013\\\": 26, \\\"ph\\\\u00e2n\\\": 271, \\\"ph\\\\u1ed5\\\": 8, \\\"bi\\\\u1ebfn\\\": 217, \\\"3\\\": 37, \\\"narrow\\\": 2, \\\"general\\\": 6, \\\"strong\\\": 4, \\\"\\\\u0111\\\\u1ed1i\\\": 111, \\\"ch\\\\u1ec9\\\": 96, \\\"ph\\\\u1ea1m\\\": 7, \\\"d\\\\u1eabn\\\": 31, \\\"b\\\\u1ea5t\\\": 19, \\\"k\\\\u1ef3\\\": 13, \\\"n\\\\u00e0o\\\": 82, \\\"t\\\\u01b0\\\\u01a1ng\\\": 129, \\\"\\\\u0111\\\\u01b0\\\\u01a1ng\\\": 25, \\\"\\\\u1edf\\\": 70, \\\"m\\\\u1ea1nh\\\": 7, \\\"kh\\\\u00e1i\\\": 12, \\\"ni\\\\u1ec7m\\\": 10, \\\"c\\\\u1ee9\\\": 10, \\\"y\\\\u1ebfu\\\": 19, \\\"weak\\\": 3, \\\"hay\\\": 149, \\\"applied\\\": 2, \\\"t\\\\u1ee9c\\\": 83, \\\"d\\\\u00f9ng\\\": 71, \\\"t\\\\u1eebng\\\": 28, \\\"b\\\\u00e0i\\\": 185, \\\"\\\\u0111\\\\u01a1n\\\": 92, \\\"l\\\\u1ebb\\\": 1, \\\"nghi\\\\u00ean\\\": 46, \\\"c\\\\u1ee9u\\\": 47, \\\"bao\\\": 37, \\\"g\\\\u1ed3m\\\": 62, \\\"chuy\\\\u00ean\\\": 31, \\\"n\\\\u1ed1i\\\": 29, \\\"l\\\\u1ea1i\\\": 124, \\\"h\\\\u1eb9p\\\": 8, \\\"x\\\\u00e2y\\\": 108, \\\"d\\\\u1ef1ng\\\": 108, \\\"nh\\\\u00e1nh\\\": 29, \\\"l\\\\u1edbn\\\": 123, \\\"\\\\u0111\\\\u00f2i\\\": 32, \\\"ta\\\": 173, \\\"c\\\\u00f2n\\\": 74, \\\"nghe\\\": 1, \\\"t\\\\u00ean\\\": 28, \\\"ho\\\\u1ea1t\\\": 11, \\\"\\\\u0111i\\\\u1ec1u\\\": 93, \\\"khi\\\\u1ec3n\\\": 7, \\\"b\\\\u1edfi\\\": 25, \\\"r\\\\u00e0ng\\\": 19, \\\"bu\\\\u1ed9c\\\": 6, \\\"ki\\\\u1ec7n\\\": 104, \\\"h\\\\u1ed7\\\": 8, \\\"tr\\\\u1ee3\\\": 20, \\\"sau\\\": 173, \\\"l\\\\u00ean\\\": 13, \\\"thi\\\\u1ebft\\\": 52, \\\"ch\\\\u01b0\\\\u01a1ng\\\": 41, \\\"l\\\\u00e0m\\\": 64, \\\"th\\\\u1ebf\\\": 92, \\\"t\\\\u1ed1t\\\": 118, \\\"rich\\\": 1, \\\"and\\\": 2, \\\"knight\\\": 1, \\\"1991\\\": 2, \\\"n\\\\u00e3o\\\": 5, \\\"chaniak\\\": 1, \\\"mcdemott\\\": 1, \\\"1985\\\": 2, \\\"winston\\\": 1, \\\"1992\\\": 5, \\\"v\\\\u1eadt\\\": 14, \\\"nilsson\\\": 1, \\\"1998\\\": 1, \\\"ph\\\\u00e9p\\\": 202, \\\"\\\\u2018con\\\": 1, \\\"ng\\\\u01b0\\\\u1eddi\\\\u2019\\\": 1, \\\"b\\\\u1eb1ng\\\": 227, \\\"l\\\\u1ea5y\\\": 54, \\\"m\\\\u00f4i\\\": 13, \\\"tr\\\\u01b0\\\\u1eddng\\\": 179, \\\"xung\\\": 17, \\\"quanh\\\": 16, \\\"h\\\\u1ed3i\\\": 40, \\\"d\\\\u1ef1a\\\": 107, \\\"g\\\\u00ec\\\": 11, \\\"c\\\\u1ea3m\\\": 15, \\\"artifical\\\": 1, \\\"tr\\\\u1ecdng\\\": 61, \\\"m\\\\u00ecnh\\\": 18, \\\"kh\\\\u00f4ng\\\": 423, \\\"ng\\\\u1edd\\\": 1, \\\"\\\\u00a0\\\": 17, \\\"t\\\\u00edch\\\": 31, \\\"th\\\\u00e1i\\\": 180, \\\"thi\\\": 10, \\\"th\\\\u1ee7\\\": 45, \\\"ph\\\\u00e1p\\\": 163, \\\"ch\\\\u1ebf\\\": 25, \\\"kinh\\\": 18, \\\"nghi\\\\u1ec7m\\\": 31, \\\"kh\\\\u1ee9\\\": 4, \\\"lai\\\": 24, \\\"d\\\\u1ef1\\\": 53, \\\"\\\\u0111o\\\\u00e1n\\\": 59, \\\"x\\\\u1ea3y\\\": 1, \\\"\\\\u00e1p\\\": 19, \\\"nay\\\": 21, \\\"v\\\\u1eabn\\\": 11, \\\"ch\\\\u01b0a\\\": 24, \\\"tr\\\\u1edf\\\": 16, \\\"b\\\\u1ea3n\\\": 93, \\\"th\\\\u00e2n\\\": 8, \\\"\\\\u00fd\\\": 31, \\\"th\\\\u1eadm\\\": 5, \\\"ch\\\\u00ed\\\": 13, \\\"b\\\\u1ed9c\\\": 1, \\\"l\\\\u1ed9\\\": 1, \\\"x\\\\u00fac\\\": 3, \\\"b\\\\u01b0\\\\u1edbc\\\": 52, \\\"ph\\\\u00e1t\\\": 96, \\\"tri\\\\u1ec3n\\\": 41, \\\"th\\\\u1eddi\\\": 139, \\\"t\\\\u1ea1i\\\": 81, \\\"nh\\\\u01b0ng\\\": 36, \\\"chung\\\": 43, \\\"r\\\\u1ea5t\\\": 72, \\\"kh\\\\u00f3\\\": 25, \\\"s\\\\u1ed1\\\": 374, \\\"c\\\\u1eadn\\\": 16, \\\"th\\\\u1ea7n\\\": 5, \\\"nh\\\\u1ecf\\\": 65, \\\"s\\\\u00e2u\\\": 99, \\\"m\\\\u1eadt\\\": 1, \\\"th\\\\u00ec\\\": 110, \\\"xa\\\": 8, \\\"c\\\\u1ea3\\\": 81, \\\"c\\\\u1ed9ng\\\": 8, \\\"\\\\u0111\\\\u1ed3ng\\\": 65, \\\"t\\\\u1ea1o\\\\u00a0al\\\\u00a0\\\\u0111\\\\u01b0\\\\u1ee3c\\\": 1, \\\"ti\\\\u1ec7n\\\": 12, \\\"t\\\\u1ea3i\\\": 1, \\\"l\\\\u00e1i\\\": 14, \\\"\\\\u0111i\\\\u1ec3n\\\": 6, \\\"h\\\\u00ecnh\\\\u00a0nh\\\\u01b0\\\\u00a0l\\\\u00e0\\\": 1, \\\"\\\\u00f4\\\": 4, \\\"t\\\\u00f4\\\": 4, \\\"g\\\\u00f3p\\\": 7, \\\"mang\\\": 7, \\\"l\\\\u1ee3i\\\": 9, \\\"\\\\u00edch\\\": 2, \\\"t\\\\u1ebf\\\": 43, \\\"h\\\\u01a1n\\\\u00a0nhi\\\\u1ec1u\\\\u00a0nh\\\\u1edd\\\": 1, \\\"bi\\\\u1ec7t\\\\u00a0h\\\\u1ea1n\\\": 1, \\\"tai\\\": 2, \\\"n\\\\u1ea1n\\\": 2, \\\"nguy\\\": 2, \\\"hi\\\\u1ec3m\\\": 6, \\\"m\\\\u1ea1ng\\\\u00a0con\\\": 1, \\\"t\\\\u1ea1o\\\\u00a0c\\\\u00f2n\\\\u00a0\\\\u0111\\\\u01b0\\\\u1ee3c\\\": 1, \\\"s\\\\u1ea3n\\\": 6, \\\"xu\\\\u1ea5t\\\": 67, \\\"\\\\u00a0c\\\\u00f4ng\\\": 1, \\\"c\\\\u00f3\\\\u00a0kh\\\\u1ea3\\\": 1, \\\"c\\\\u01a1\\\": 59, \\\"s\\\\u1edf\\\": 38, \\\"n\\\\u0103ng\\\\u00a0ra\\\": 1, \\\"bi\\\\u1ec3u\\\": 146, \\\"y\\\": 89, \\\"t\\\\u1ebf\\\\u00a0\\\\u0111\\\\u00f3\\\": 1, \\\"ch\\\\u00ednh\\\\u00a0l\\\\u00e0\\\": 1, \\\"bay\\\": 5, \\\"kh\\\\u00f4ng\\\\u00a0c\\\\u1ea7n\\\\u00a0ng\\\\u01b0\\\\u1eddi\\\": 1, \\\"h\\\\u1ed9\\\": 1, \\\"kh\\\\u1ea9n\\\": 1, \\\"c\\\\u00f3\\\\u00a0th\\\\u1ec3\\\": 1, \\\"\\\\u0111\\\\u01b0\\\\u1ee3c\\\\u00a0t\\\\u1ed1c\\\": 1, \\\"xe\\\": 15, \\\"40\\\": 1, \\\"c\\\\u1ef1c\\\": 35, \\\"k\\\\u00ec\\\\u00a0th\\\\u00edch\\\": 1, \\\"n\\\\u01a1i\\\": 2, \\\"\\\\u0111\\\\u1ecba\\\": 16, \\\"\\\\u0111\\\\u1eddi\\\": 4, \\\"t\\\\u1ea1o\\\\u00a0\\\\u0111\\\\u00e3\\\\u00a0t\\\\u1ea1o\\\": 1, \\\"\\\\u0111\\\\u1ed5i\\\": 55, \\\"gi\\\\u00e1o\\\": 4, \\\"d\\\\u1ee5c\\\": 3, \\\"nh\\\\u01b0\\\\u00a0l\\\\u00e0\\\\u00a0ch\\\\u1ea5m\\\": 1, \\\"d\\\\u1ea1y\\\": 1, \\\"k\\\\u00e8m\\\\u00a0cho\\\\u00a0h\\\\u1ecdc\\\": 1, \\\"sinh\\\": 92, \\\"h\\\\u00f3a\\\\u00a0ho\\\\u00e0n\\\": 1, \\\"to\\\\u00e0n\\\\u00a0nh\\\\u1edd\\\": 1, \\\"ra\\\\u00a0\\\\u0111\\\\u01b0\\\\u1ee3c\\\\u00a0nh\\\\u1eefng\\\": 1, \\\"kh\\\\u00f3a\\\": 4, \\\"c\\\\u1ea3i\\\": 11, \\\"thi\\\\u1ec7n\\\": 9, \\\"truy\\\\u1ec1n\\\": 26, \\\"th\\\\u00f4ng\\\\u00a0th\\\\u00ec\\\\u00a0s\\\\u1ef1\\\": 1, \\\"t\\\\u1ea1o\\\\u00a0\\\\u0111\\\\u00e3\\\\u00a0g\\\\u00f3p\\\": 1, \\\"kh\\\\u00e1ch\\\": 10, \\\"h\\\\u00e0ng\\\": 41, \\\"t\\\\u1ea1o\\\\u00a0gi\\\\u00fap\\\": 1, \\\"d\\\\u1ecbch\\\": 30, \\\"\\\\u0111\\\\u1ed9ng\\\\u00a0m\\\\u1ed9t\\\": 1, \\\"c\\\\u00e1ch\\\\u00a0t\\\\u1ed1i\\\": 1, \\\"tr\\\\u1ea3i\\\": 1, \\\"m\\\\u1edbi\\\": 74, \\\"m\\\\u1ebb\\\": 5, \\\"\\\\u00a0t\\\\u1ed1t\\\": 1, \\\"m\\\\u1eb7c\\\": 20, \\\"d\\\\u00f9\\\": 20, \\\"t\\\\u1ef1u\\\": 2, \\\"\\\\u0111\\\\u00e1ng\\\": 6, \\\"k\\\\u1ec3\\\": 16, \\\"m\\\\u1ee9c\\\": 32, \\\"t\\\\u1ed5ng\\\": 53, \\\"qu\\\\u00e1t\\\": 25, \\\"\\\\u0111\\\\u00e1nh\\\": 37, \\\"gi\\\\u00e1\\\": 364, \\\"s\\\\u00e1nh\\\": 8, \\\"k\\\\u00e9m\\\": 9, \\\"t\\\\u1ee5c\\\": 52, \\\"n\\\\u1eefa\\\": 6, \\\"gi\\\\u1ecfi\\\": 4, \\\"\\\\u0111a\\\": 39, \\\"tuy\\\": 39, \\\"nhi\\\\u00ean\\\": 144, \\\"g\\\\u1eb7p\\\": 19, \\\"v\\\\u01b0\\\\u1ee3t\\\": 11, \\\"ngo\\\\u00e0i\\\": 18, \\\"c\\\\u1ea3nh\\\": 3, \\\"ban\\\": 29, \\\"th\\\\u01b0\\\\u1edbc\\\": 33, \\\"\\\\u0111o\\\": 43, \\\"th\\\\u1eed\\\": 23, \\\"turing\\\": 16, \\\"v\\\\u00e0o\\\": 143, \\\"n\\\\u0103m\\\": 83, \\\"1950\\\": 7, \\\"alan\\\": 4, \\\"nh\\\\u00e0\\\": 7, \\\"\\\\u0111\\\\u00f3ng\\\": 28, \\\"\\\\u0111\\\\u00e3\\\": 95, \\\"test\\\": 1, \\\"n\\\\u1ebfu\\\": 160, \\\"ki\\\\u1ec3m\\\": 64, \\\"tra\\\": 63, \\\"c\\\\u00e2u\\\": 238, \\\"d\\\\u1ea1ng\\\": 172, \\\"v\\\\u0103n\\\": 44, \\\"tr\\\\u1ea3\\\": 42, \\\"l\\\\u1eddi\\\": 137, \\\"chat\\\": 2, \\\"nh\\\\u1eafn\\\": 1, \\\"th\\\\u1eadt\\\": 7, \\\"l\\\\u01b0u\\\": 33, \\\"r\\\\u1eb1ng\\\": 22, \\\"tr\\\\u1ef1c\\\": 13, \\\"gi\\\\u1eefa\\\": 57, \\\"vi\\\\u1ec7t\\\": 6, \\\"di\\\\u1ec5n\\\": 291, \\\"tri\\\": 100, \\\"ph\\\\u1ee5c\\\": 9, \\\"ho\\\\u00e0n\\\": 12, \\\"m\\\\u1eabu\\\": 117, \\\"l\\\\u1ecbch\\\": 7, \\\"eliza\\\": 1, \\\"th\\\\u00e1ng\\\": 3, \\\"6\\\": 3, \\\"2014\\\": 3, \\\"eugene\\\": 2, \\\"goostman\\\": 2, \\\"nh\\\\u00f3m\\\": 10, \\\"nga\\\": 3, \\\"gi\\\\u00e0nh\\\": 4, \\\"cu\\\\u1ed9c\\\": 5, \\\"\\\\u0111o\\\\u1ea1n\\\": 45, \\\"h\\\\u1ed9i\\\": 15, \\\"tho\\\\u1ea1i\\\": 3, \\\"d\\\\u00e0i\\\": 11, \\\"5\\\": 14, \\\"ph\\\\u00fat\\\": 1, \\\"33\\\": 1, \\\"gi\\\\u00e1m\\\": 25, \\\"kh\\\\u1ea3o\\\": 12, \\\"ki\\\\u1ebfn\\\": 23, \\\"ti\\\\u00ean\\\": 46, \\\"d\\\\u1eaft\\\": 2, \\\"t\\\\u00ecm\\\": 365, \\\"ch\\\\u1ee5p\\\": 6, \\\"\\\\u1ea3nh\\\": 38, \\\"s\\\\u00f3ng\\\": 1, \\\"t\\\\u00edn\\\": 9, \\\"\\\\u0111i\\\\u1ec7n\\\": 9, \\\"n\\\\u01a1\\\": 22, \\\"ron\\\": 22, \\\"k\\\\u00edch\\\": 32, \\\"ph\\\\u1eabu\\\": 1, \\\"v\\\": 40, \\\"gps\\\": 5, \\\"problem\\\": 2, \\\"solver\\\": 2, \\\"newell\\\": 4, \\\"simon\\\": 4, \\\"1961\\\": 1, \\\"chu\\\\u1ed7i\\\": 15, \\\"khu\\\\u00f4n\\\": 7, \\\"kh\\\\u1ed5\\\": 5, \\\"cognitive\\\": 2, \\\"v\\\\u00ed\\\": 176, \\\"d\\\\u1ee5\\\": 175, \\\"th\\\\u1ecb\\\": 29, \\\"gi\\\\u00e1c\\\": 17, \\\"k\\\\u1ebf\\\": 27, \\\"m\\\\u1ea1ch\\\": 2, \\\"tr\\\\u00fac\\\": 20, \\\"neuromorphic\\\": 1, \\\"chips\\\": 1, \\\"l\\\\u01b0\\\\u1ee3ng\\\": 117, \\\"kh\\\\u1ed1i\\\": 7, \\\"ti\\\\u1ec1n\\\": 9, \\\"g\\\\u1ed1c\\\": 29, \\\"r\\\\u1ec5\\\": 1, \\\"tri\\\\u1ebft\\\": 3, \\\"hy\\\": 1, \\\"l\\\\u1ea1p\\\": 1, \\\"aristot\\\": 1, \\\"kh\\\\u1edfi\\\": 35, \\\"x\\\\u01b0\\\\u1edbng\\\": 2, \\\"kh\\\\u0103n\\\": 7, \\\"h\\\\u01a1p\\\": 1, \\\"di\\\\u1ec7n\\\": 4, \\\"t\\\\u1ed1\\\": 10, \\\"\\\\u0111\\\\u1ea7y\\\": 56, \\\"\\\\u0111\\\\u1ee7\\\": 63, \\\"khai\\\": 10, \\\"trung\\\": 17, \\\"t\\\\u1eed\\\": 107, \\\"agent\\\": 1, \\\"\\\\u0111em\\\": 4, \\\"v\\\\u1ecdng\\\": 5, \\\"ch\\\\u1eafn\\\": 7, \\\"gi\\\\u1ed1ng\\\": 20, \\\"l\\\\u00fac\\\": 3, \\\"ph\\\\u1ed1i\\\": 3, \\\"ki\\\\u1ec3u\\\": 6, \\\"x\\\\u1ea1\\\": 14, \\\"ch\\\\u1eb3ng\\\": 46, \\\"ph\\\\u1ee9c\\\": 72, \\\"t\\\\u1ea1p\\\": 66, \\\"hai\\\": 144, \\\"k\\\\u1ef9\\\": 48, \\\"giai\\\": 37, \\\"1943\\\": 3, \\\"1955\\\": 1, \\\"1952\\\": 3, \\\"1969\\\": 3, \\\"tr\\\\u1ea7m\\\": 1, \\\"l\\\\u1eafng\\\": 1, \\\"1979\\\": 1, \\\"ph\\\\u1ea9m\\\": 2, \\\"th\\\\u01b0\\\\u01a1ng\\\": 9, \\\"m\\\\u1ea1i\\\": 9, \\\"1980\\\": 4, \\\"1987\\\": 4, \\\"2001\\\": 1, \\\"warren\\\": 2, \\\"mcculloch\\\": 1, \\\"walter\\\": 2, \\\"pitts\\\": 2, \\\"m\\\\u1ea1ng\\\": 94, \\\"th\\\\u1ea5y\\\": 25, \\\"h\\\\u00e0m\\\": 215, \\\"b\\\\u1ed1\\\": 28, \\\"b\\\\u00e1o\\\": 10, \\\"nh\\\\u1eafc\\\": 5, \\\"l\\\\u1ea7n\\\": 33, \\\"di\\\": 47, \\\"c\\\\u01b0\\\\u1eddng\\\": 5, \\\"1956\\\": 3, \\\"m\\\\u01b0\\\\u1eddi\\\": 1, \\\"tr\\\\u1ebb\\\": 1, \\\"t\\\\u1ed5\\\": 32, \\\"th\\\\u1ea3o\\\": 1, \\\"k\\\\u00e9o\\\": 25, \\\"dartmouth\\\": 2, \\\"n\\\\u1ec1n\\\": 3, \\\"m\\\\u00f3ng\\\": 1, \\\"c\\\\u00f9ng\\\": 46, \\\"\\\\u201cartificial\\\": 1, \\\"intelligence\\\\u201d\\\": 1, \\\"theorist\\\": 3, \\\"ch\\\\u1ee9ng\\\": 46, \\\"l\\\\u1edbp\\\": 34, \\\"ti\\\\u1ebfn\\\": 42, \\\"38\\\": 1, \\\"52\\\": 1, \\\"s\\\\u00e1ch\\\": 27, \\\"tam\\\": 1, \\\"c\\\\u00e2n\\\": 4, \\\"ng\\\\u1eafn\\\": 22, \\\"arthur\\\": 3, \\\"samuel\\\": 3, \\\"ch\\\\u01a1i\\\": 25, \\\"c\\\\u1edd\\\": 14, \\\"\\\\u0111am\\\": 2, \\\"checkers\\\": 1, \\\"th\\\\u1eafng\\\": 9, \\\"nghi\\\\u1ec7p\\\": 4, \\\"d\\\\u01b0\\\": 4, \\\"nh\\\\u1edd\\\": 19, \\\"1958\\\": 3, \\\"john\\\": 6, \\\"mccarthy\\\": 5, \\\"lisp\\\": 7, \\\"adalines\\\": 1, \\\"bernie\\\": 1, \\\"widrow\\\": 1, \\\"1962\\\": 3, \\\"perceptron\\\": 1, \\\"rosenblatt\\\": 1, \\\"nhi\\\\u1ec3u\\\": 1, \\\"thong\\\": 1, \\\"kho\\\\u1ea3ng\\\": 38, \\\"1974\\\": 3, \\\"m\\\\u00f9a\\\": 6, \\\"\\\\u0111\\\\u00f4ng\\\": 7, \\\"winter\\\": 2, \\\"h\\\\u1ea1t\\\": 2, \\\"kh\\\\u00ed\\\": 3, \\\"h\\\\u1eadu\\\": 10, \\\"\\\\u0111\\\\u1ea5t\\\": 1, \\\"l\\\\u1ea1nh\\\": 4, \\\"l\\\\u1ebdo\\\": 1, \\\"x\\\\u1ea9y\\\": 14, \\\"chi\\\\u1ebfn\\\": 9, \\\"tranh\\\": 6, \\\"1993\\\": 4, \\\"tr\\\\u00ec\\\": 12, \\\"tr\\\\u1ec7\\\": 2, \\\"\\\\u0111i\\\": 102, \\\"xu\\\\u1ed1ng\\\": 9, \\\"gia\\\": 28, \\\"th\\\\u1ea5t\\\": 10, \\\"b\\\\u1ea1i\\\": 4, \\\"ph\\\\u1ee7\\\": 21, \\\"nh\\\\u1eadt\\\": 13, \\\"t\\\\u00e0i\\\": 10, \\\"kh\\\\u1eafc\\\": 6, \\\"ch\\\\u00fa\\\": 3, \\\"th\\\\u00f9\\\": 3, \\\"expert\\\": 1, \\\"systems\\\": 2, \\\"1972\\\": 2, \\\"alain\\\": 1, \\\"colmerauer\\\": 1, \\\"prolog\\\": 9, \\\"programming\\\": 2, \\\"v\\\\u1ecb\\\": 57, \\\"10\\\": 7, \\\"deep\\\": 8, \\\"network\\\": 1, \\\"\\\\u0111ang\\\": 27, \\\"\\\\u00e2m\\\": 29, \\\"thanh\\\": 8, \\\"1981\\\": 1, \\\"ch\\\\u1ea1y\\\": 7, \\\"k\\\\u00ea\\\": 27, \\\"markov\\\": 2, \\\"\\\\u1ea9n\\\": 2, \\\"hidden\\\": 1, \\\"models\\\": 1, \\\"t\\\\u1ed3n\\\": 34, \\\"l\\\\u00e2u\\\": 5, \\\"google\\\": 16, \\\"song\\\": 8, \\\"lu\\\\u1eadt\\\": 52, \\\"v\\\\u00e0i\\\": 8, \\\"xu\\\": 8, \\\"big\\\": 2, \\\"data\\\": 5, \\\"ch\\\\u1ea5t\\\": 51, \\\"gian\\\": 100, \\\"h\\\\u01b0\\\\u1edfng\\\": 20, \\\"khuy\\\\u1ebfn\\\": 5, \\\"ngh\\\\u1ecb\\\": 4, \\\"amazon\\\": 3, \\\"siri\\\": 4, \\\"apple\\\": 3, \\\"gi\\\\u1ecdng\\\": 4, \\\"tr\\\\u00f2\\\": 23, \\\"watson\\\": 6, \\\"ibm\\\": 9, \\\"mccullough\\\": 1, \\\"\\\\u201ca\\\": 1, \\\"logical\\\": 1, \\\"calculus\\\": 1, \\\"ideas\\\": 1, \\\"immanent\\\": 1, \\\"in\\\": 7, \\\"nervous\\\": 1, \\\"activity\\\\u00a0\\\\u2013\\\": 1, \\\"l\\\\u00f4gic\\\": 2, \\\"n\\\\u1ed9i\\\": 9, \\\"\\\\u201d\\\\u00a0b\\\\u00e0i\\\": 1, \\\"cu\\\\u1ed1n\\\": 2, \\\"\\\\u201ccomputing\\\": 1, \\\"machinery\\\": 1, \\\"c\\\\u00e1i\\\": 7, \\\"l\\\\u00e0\\\\u00a0ph\\\\u00e9p\\\": 1, \\\"vi\\\\u00ean\\\": 23, \\\"\\\\u0111\\\\u1ea1i\\\": 26, \\\"harvard\\\": 1, \\\"marvin\\\": 2, \\\"minsky\\\": 3, \\\"dean\\\": 1, \\\"edmonds\\\": 1, \\\"snarc\\\": 1, \\\"claude\\\": 1, \\\"shannon\\\": 1, \\\"\\\\u201cprogramming\\\": 1, \\\"a\\\": 161, \\\"for\\\": 7, \\\"playing\\\": 1, \\\"chess\\\\u00a0\\\\u2013\\\": 1, \\\"\\\\u201d\\\": 6, \\\"isaac\\\": 1, \\\"asimov\\\": 1, \\\"\\\\u201cthree\\\": 1, \\\"laws\\\": 1, \\\"robotics\\\\u00a0\\\\u2013\\\": 1, \\\"ba\\\": 15, \\\"\\\\u201d\\\\u00a0\\\\u00a0\\\": 1, \\\"caro\\\": 1, \\\"1954\\\": 1, \\\"th\\\\u00ed\\\": 3, \\\"georgetown\\\": 1, \\\"60\\\": 1, \\\"l\\\\u1ef1a\\\": 68, \\\"ch\\\\u1ecdn\\\": 150, \\\"c\\\\u1ea9n\\\": 2, \\\"th\\\\u1eadn\\\": 2, \\\"sang\\\": 29, \\\"c\\\\u1ee5m\\\": 3, \\\"\\\\u201cdartmouth\\\": 1, \\\"summer\\\": 1, \\\"research\\\": 1, \\\"project\\\": 1, \\\"on\\\": 1, \\\"h\\\\u00e8\\\": 1, \\\"\\\\u201d\\\\u00a0\\\\u0111\\\\u01b0\\\\u1ee3c\\\": 1, \\\"allen\\\": 2, \\\"herbert\\\": 3, \\\"lt\\\": 1, \\\"\\\\u201cprograms\\\": 1, \\\"with\\\": 1, \\\"common\\\": 1, \\\"sense\\\": 1, \\\"chung\\\\u201d\\\": 1, \\\"\\\\u00a0b\\\\u00e0i\\\": 1, \\\"gi\\\\u1ea3\\\": 34, \\\"taker\\\": 1, \\\"ch\\\\u1ec9nh\\\": 4, \\\"\\\\u00a0\\\\u00a0\\\": 1, \\\"1959\\\": 4, \\\"jc\\\": 1, \\\"shaw\\\": 1, \\\"gelernter\\\": 1, \\\"geometry\\\": 1, \\\"theorem\\\": 1, \\\"prover\\\": 2, \\\"mit\\\": 1, \\\"n\\\\u0103m1963\\\": 1, \\\"ph\\\\u00f2ng\\\": 4, \\\"stanford\\\": 3, \\\"1966\\\": 1, \\\"c\\\\u00e1o\\\": 7, \\\"c\\\\u1ee7a\\\\u00a0the\\\": 1, \\\"automatic\\\": 2, \\\"language\\\": 2, \\\"processing\\\": 2, \\\"advisory\\\": 1, \\\"committee\\\\u00a0\\\\u2013\\\": 1, \\\"\\\\u1ee7y\\\": 1, \\\"c\\\\u1ed1\\\": 12, \\\"alpac\\\": 3, \\\"hoa\\\": 15, \\\"n\\\\u00eau\\\": 1, \\\"thi\\\\u1ebfu\\\": 1, \\\"s\\\\u00e1ng\\\": 4, \\\"\\\\u200b\\\\u200bl\\\\u1edbn\\\": 1, \\\"h\\\\u1ee9a\\\": 3, \\\"h\\\\u1eb9n\\\": 3, \\\"\\\\u00a0b\\\\u00e1o\\\": 1, \\\"h\\\\u1ee7y\\\": 1, \\\"t\\\\u1ea5t\\\": 55, \\\"mt\\\": 1, \\\"1973\\\": 1, \\\"\\\\u201cb\\\\u00e1o\\\": 2, \\\"lighthill\\\\u201d\\\": 2, \\\"nghi\\\\u00eam\\\": 2, \\\"ngu\\\\u1ed3n\\\": 5, \\\"darpa\\\": 4, \\\"kho\\\\u1ea3n\\\": 1, \\\"\\\\u00a0k\\\\u1ebft\\\": 1, \\\"c\\\\u1ea1n\\\": 4, \\\"ki\\\\u1ec7t\\\": 1, \\\"\\\\u00a0giai\\\": 1, \\\"\\\\u201cfirst\\\": 1, \\\"\\\\u201d\\\\u00a0\\\": 1, \\\"\\\\u0111o\\\\u00e0n\\\": 1, \\\"r1\\\": 2, \\\"xcon\\\": 2, \\\"\\\\u00a0\\\\u0111\\\\u01b0\\\\u1ee3c\\\": 1, \\\"b\\\\u00f9ng\\\": 1, \\\"n\\\\u1ed5\\\": 1, \\\"k\\\\u1ef7\\\": 5, \\\"th\\\\u00fac\\\": 9, \\\"\\\\u201cm\\\\u00f9a\\\": 2, \\\"ti\\\\u00ean\\\\u201d\\\": 1, \\\"1982\\\": 1, \\\"\\\\u00a0japan\\\\u2019s\\\": 1, \\\"ministry\\\": 1, \\\"international\\\": 1, \\\"qu\\\\u1ed1c\\\": 2, \\\"tham\\\": 84, \\\"v\\\\u1ecdng\\\\u00a0fifth\\\": 1, \\\"generation\\\": 1, \\\"fgcs\\\": 4, \\\"\\\\u00a0\\\\u2013\\\": 1, \\\"su\\\\u1ea5t\\\": 241, \\\"si\\\\u00eau\\\": 20, \\\"t\\\\u1ea3ng\\\": 1, \\\"n\\\\u0103m1983\\\": 1, \\\"\\\\u0111\\\\u00e1p\\\": 7, \\\"\\\\u0111\\\\u1ed9ng\\\\u00a0strategic\\\": 1, \\\"computing\\\": 1, \\\"initiative\\\\u00a0\\\\u2013\\\": 1, \\\"\\\\u200b\\\\u200b\\\\u0111i\\\\u1ec7n\\\": 2, \\\"l\\\\u01b0\\\\u1ee3c\\\": 3, \\\"cung\\\": 31, \\\"ty\\\": 3, \\\"t\\\\u1ef7\\\": 19, \\\"\\\\u0111\\\\u00f4\\\": 5, \\\"la\\\": 2, \\\"m\\\\u1ed7i\\\": 126, \\\"to\\\\u00e0n\\\": 48, \\\"h\\\\u1ecd\\\": 4, \\\"\\\\u00a0c\\\\u00e1c\\\": 1, \\\"symbolics\\\": 1, \\\"inc\\\": 1, \\\"r\\\\u1ebb\\\": 1, \\\"s\\\\u1ee5p\\\": 1, \\\"\\\\u0111\\\\u1ed5\\\": 1, \\\"m\\\\u1edf\\\": 50, \\\"hai\\\\u201d\\\": 1, \\\"\\\\u00a0trong\\\": 1, \\\"t\\\\u1ecf\\\": 1, \\\"\\\\u0111\\\\u1eaft\\\": 1, \\\"c\\\\u1eadp\\\": 9, \\\"cu\\\\u1ed1i\\\": 11, \\\"\\\\u01b0a\\\": 1, \\\"chu\\\\u1ed9ng\\\": 1, \\\"l\\\\u1ef1c\\\": 2, \\\"dart\\\": 1, \\\"ho\\\\u1ea1ch\\\": 18, \\\"v\\\\u00f9ng\\\": 11, \\\"v\\\\u1ecbnh\\\": 2, \\\"ch\\\\u1ea5m\\\": 1, \\\"d\\\\u1ee9t\\\": 1, \\\"v\\\\u1ea1ch\\\": 1, \\\"1\\\": 135, \\\"1997\\\": 2, \\\"blue\\\": 3, \\\"v\\\\u00f4\\\": 20, \\\"\\\\u0111\\\\u1ecbch\\\": 5, \\\"vua\\\": 8, \\\"gary\\\": 2, \\\"kasparov\\\": 3, \\\"2005\\\": 2, \\\"stanley\\\": 1, \\\"chi\\\\u1ebfc\\\": 1, \\\"grand\\\": 1, \\\"challenge\\\": 1, \\\"qu\\\\u00e2n\\\": 5, \\\"\\\\u0111\\\\u1ed9i\\\": 2, \\\"robot\\\": 3, \\\"\\\\u201cbig\\\": 1, \\\"dog\\\\u201d\\\": 1, \\\"boston\\\": 1, \\\"dynamics\\\": 1, \\\"\\\\u201cpackbot\\\\u201d\\\": 1, \\\"irobot\\\": 2, \\\"2008\\\": 1, \\\"\\\\u0111\\\\u1ed9t\\\": 24, \\\"ph\\\\u00e1\\\": 8, \\\"thi\\\\u1ec7u\\\": 1, \\\"iphone\\\": 2, \\\"2011\\\": 3, \\\"\\\\u00a0watson\\\": 1, \\\"ibm\\\\u00a0v\\\\u01b0\\\\u1ee3t\\\": 1, \\\"c\\\\u1ea1nh\\\": 12, \\\"tr\\\\u00ean\\\\u00a0jeopardy\\\": 1, \\\"\\\\u1ea3o\\\": 3, \\\"ios\\\": 1, \\\"2012\\\": 1, \\\"andrew\\\": 1, \\\"ng\\\": 1, \\\"brain\\\": 1, \\\"learning\\\": 10, \\\"l\\\\u01b0\\\\u1edbi\\\": 2, \\\"tri\\\\u1ec7u\\\": 9, \\\"video\\\": 3, \\\"youtube\\\": 2, \\\"\\\\u0111\\\\u00e0o\\\": 1, \\\"\\\\u00a0m\\\\u1ea1ng\\\": 1, \\\"m\\\\u00e8o\\\": 2, \\\"ra\\\\u00a0chi\\\\u1ebfc\\\": 1, \\\"l\\\\u00e1i\\\\u00a0\\\\u0111\\\\u1ea7u\\\": 1, \\\"ti\\\\u1ec3u\\\": 3, \\\"bang\\\": 1, \\\"alexa\\\": 1, \\\"ng\\\\u00f4i\\\": 1, \\\"h\\\\u00e0nh\\\\u00a0\\\": 1, \\\"2016\\\": 2, \\\"\\\\u00a0alphago\\\\u00a0c\\\\u1ee7a\\\": 1, \\\"deepmind\\\": 1, \\\"v\\\\u00e2y\\\": 1, \\\"lee\\\": 1, \\\"sedol\\\": 1, \\\"\\\\u00a0s\\\\u1ef1\\\": 1, \\\"c\\\\u1ed5\\\": 1, \\\"ng\\\\u1ea1i\\\": 1, \\\"\\\\u201cc\\\\u00f4ng\\\": 1, \\\"d\\\\u00e2n\\\": 1, \\\"robot\\\\u201d\\\": 1, \\\"sophia\\\": 1, \\\"hanson\\\": 1, \\\"robotics\\\": 2, \\\"m\\\\u1eb7t\\\": 19, \\\"2018\\\": 2, \\\"nhi\\\\u00ean\\\\u00a0bert\\\\u00a0\\\": 1, \\\"r\\\\u00e0o\\\": 1, \\\"c\\\\u1ea3n\\\": 2, \\\"\\\\u00a0waymo\\\\u00a0ra\\\": 1, \\\"m\\\\u1eaft\\\": 2, \\\"v\\\\u1ee5\\\\u00a0waymo\\\": 1, \\\"one\\\": 4, \\\"kh\\\\u1eafp\\\": 1, \\\"khu\\\": 2, \\\"phoenix\\\": 1, \\\"y\\\\u00eau\\\": 52, \\\"c\\\\u1ea7u\\\": 49, \\\"\\\\u0111\\\\u00f3n\\\": 1, \\\"2020\\\": 1, \\\"baidu\\\": 1, \\\"to\\\\u00e1n\\\\u00a0linearfold\\\": 1, \\\"ai\\\\u00a0c\\\\u1ee7a\\\": 1, \\\"v\\\\u1eafc\\\": 1, \\\"xin\\\": 1, \\\"sars\\\": 1, \\\"cov\\\": 1, \\\"2\\\": 69, \\\"\\\\u00a0thu\\\\u1eadt\\\": 1, \\\"rna\\\": 1, \\\"virus\\\": 1, \\\"27\\\": 1, \\\"gi\\\\u00e2y\\\": 1, \\\"120\\\": 1, \\\"m\\\\u00e3i\\\": 2, \\\"d\\\\u1ea7n\\\": 44, \\\"perception\\\": 1, \\\"reasoning\\\": 4, \\\"action\\\": 1, \\\"b\\\\u00ean\\\": 16, \\\"camera\\\": 3, \\\"microphone\\\": 1, \\\"radar\\\": 1, \\\"t\\\\u1ed1c\\\": 6, \\\"gi\\\\u1ea3n\\\": 73, \\\"nh\\\\u1eadp\\\": 7, \\\"tay\\\": 10, \\\"vision\\\": 1, \\\"m\\\\u00e3\\\": 18, \\\"unicode\\\": 2, \\\"ch\\\\u1eef\\\": 16, \\\"pattern\\\": 2, \\\"recognition\\\": 5, \\\"chuy\\\\u1ec3n\\\": 75, \\\"motion\\\": 1, \\\"analysis\\\": 1, \\\"khung\\\": 1, \\\"3d\\\": 1, \\\"scene\\\": 1, \\\"reconstruction\\\": 1, \\\"n\\\\u00e2ng\\\": 1, \\\"image\\\": 1, \\\"restoration\\\": 1, \\\"v\\\\u00e2n\\\": 2, \\\"nh\\\\u00ecn\\\": 5, \\\"th\\\\u1eb3ng\\\": 2, \\\"tuy\\\\u1ec7t\\\": 8, \\\"tr\\\\u00f2ng\\\": 1, \\\"r\\\\u00e3i\\\": 3, \\\"an\\\": 10, \\\"ninh\\\": 1, \\\"facebook\\\": 1, \\\"quen\\\": 1, \\\"g\\\\u00e1n\\\": 14, \\\"nh\\\\u00e3n\\\": 84, \\\"tr\\\\u01b0ng\\\": 60, \\\"natural\\\": 1, \\\"b\\\\u00e0y\\\": 4, \\\"g\\\\u00f5\\\": 2, \\\"l\\\\u1ec7nh\\\": 2, \\\"\\\\u01b0\\\\u1edbc\\\": 12, \\\"tr\\\\u1ecb\\\": 310, \\\"speech\\\": 4, \\\"text\\\": 2, \\\"to\\\": 11, \\\"stt\\\": 1, \\\"ki\\\\u1ebfm\\\": 224, \\\"\\\\u0111\\\\u1ecdc\\\": 3, \\\"truy\\\": 20, \\\"h\\\\u00e3ng\\\": 3, \\\"nuance\\\": 1, \\\"now\\\": 1, \\\"ch\\\\u1ee5c\\\": 2, \\\"ph\\\\u1ee5\\\": 22, \\\"ng\\\\u1eefu\\\": 1, \\\"question\\\": 2, \\\"answering\\\": 2, \\\"t\\\\u00e1ch\\\": 6, \\\"t\\\\u00f3m\\\": 1, \\\"dung\\\": 8, \\\"c\\\\u00fa\\\": 10, \\\"l\\\\u1ecdc\\\": 26, \\\"th\\\\u01b0\\\": 34, \\\"r\\\\u00e1c\\\": 18, \\\"microsoft\\\": 2, \\\"yahoo\\\": 2, \\\"\\\\u0111\\\\u1ec1u\\\": 22, \\\"t\\\\u00e1n\\\": 1, \\\"c\\\\u00e2y\\\": 113, \\\"nh\\\\u1eb1ng\\\": 2, \\\"ng\\\\u00f4\\\": 1, \\\"sao\\\": 47, \\\"jeopardy\\\": 4, \\\"ph\\\\u00fa\\\": 2, \\\"information\\\": 4, \\\"extraction\\\": 1, \\\"ri\\\\u00eang\\\": 27, \\\"thu\\\\u1eadn\\\": 18, \\\"named\\\": 1, \\\"entity\\\": 1, \\\"r\\\\u00f4\\\": 11, \\\"b\\\\u1ed1t\\\": 10, \\\"ch\\\\u1ea5p\\\": 15, \\\"c\\\\u00e1nh\\\": 1, \\\"thoa\\\": 1, \\\"\\\\u0111i\\\\u1ec3u\\\": 1, \\\"nh\\\\u1ea9y\\\": 2, \\\"m\\\\u00faa\\\": 1, \\\"asimo\\\": 1, \\\"nao\\\": 1, \\\"s\\\\u1ed1ng\\\": 1, \\\"roomba\\\": 2, \\\"tr\\\\u00e1nh\\\": 15, \\\"chui\\\": 1, \\\"ng\\\\u00f3c\\\": 1, \\\"ng\\\\u00e1ch\\\": 1, \\\"lau\\\": 1, \\\"s\\\\u1ea1ch\\\": 1, \\\"s\\\\u00e0n\\\": 1, \\\"b\\\\u00e1n\\\": 3, \\\"t\\\\u1ea7u\\\": 1, \\\"th\\\\u1ee7y\\\": 1, \\\"th\\\\u00e1m\\\": 3, \\\"v\\\\u0169\\\": 2, \\\"tr\\\\u1ee5\\\": 2, \\\"n\\\\u1ed5i\\\": 1, \\\"20\\\": 1, \\\"km\\\": 1, \\\"gi\\\\u1edd\\\": 3, \\\"v\\\\u00f2ng\\\": 24, \\\"tinh\\\": 10, \\\"h\\\\u1ecfa\\\": 1, \\\"nasa\\\": 1, \\\"mi\\\\u1ec1n\\\": 17, \\\"microworld\\\": 1, \\\"saint\\\": 1, \\\"james\\\": 1, \\\"slagle\\\": 1, \\\"1963\\\": 1, \\\"1965\\\": 1, \\\"robinson\\\": 1, \\\"\\\\u201chi\\\\u1ec3u\\\\u201d\\\": 1, \\\"mining\\\": 2, \\\"tr\\\\u1ea1ng\\\": 178, \\\"\\\\u0111\\\\u01b0\\\\u1eddng\\\": 85, \\\"tho\\\\u1ea3\\\": 6, \\\"m\\\\u00e3n\\\": 15, \\\"heuristic\\\": 29, \\\"c\\\\u1ee5c\\\": 20, \\\"r\\\\u00f5\\\": 14, \\\"co\\\": 1, \\\"ch\\\\u1ea1m\\\": 1, \\\"n\\\\u01b0\\\\u1edbc\\\": 3, \\\"s\\\\u00f4i\\\": 1, \\\"kho\\\\u00e1\\\": 2, \\\"x\\\\u00ed\\\": 1, \\\"\\\\u0111\\\\u1ea3m\\\": 9, \\\"b\\\\u1ea3o\\\": 9, \\\"m\\\\u1ef9\\\": 2, \\\"c\\\\u01a1n\\\": 1, \\\"b\\\\u00e3o\\\": 1, \\\"sa\\\": 2, \\\"m\\\\u1ea1c\\\": 1, \\\"iraq\\\": 1, \\\"m\\\\u00e2u\\\": 4, \\\"thu\\\\u1eabn\\\": 4, \\\"\\\\u201cn\\\\u1ebfu\\\\u2026th\\\\u00ec\\\\u2026\\\\u201d\\\": 1, \\\"ch\\\\u1ee9a\\\": 51, \\\"t\\\\u01a1\\\": 15, \\\"dendral\\\": 5, \\\"1967\\\": 1, \\\"h\\\\u1eefu\\\": 16, \\\"mycin\\\": 4, \\\"ch\\\\u1ea9n\\\": 17, \\\"b\\\\u1ec7nh\\\": 12, \\\"nhi\\\\u1ec5m\\\": 18, \\\"tr\\\\u00f9ng\\\": 13, \\\"m\\\\u00e1u\\\": 3, \\\"450\\\": 1, \\\"b\\\\u00e1c\\\": 4, \\\"s\\\\u0129\\\": 4, \\\"doanh\\\": 1, \\\"r\\\\u01a1i\\\": 4, \\\"xx\\\": 1, \\\"dec\\\": 1, \\\"ca\\\": 1, \\\"th\\\\u1ecf\\\": 1, \\\"\\\\u0111u\\\\u1ed5i\\\": 1, \\\"k\\\\u1ecbp\\\": 1, \\\"\\\\u0111\\\\u1ea5u\\\": 5, \\\"v\\\\u00e1n\\\": 1, \\\"kim\\\": 5, \\\"qu\\\\u00e1n\\\": 3, \\\"\\\\u201cai\\\": 1, \\\"ph\\\\u00fa\\\\u201d\\\": 1, \\\"nam\\\": 7, \\\"200\\\": 1, \\\"trang\\\": 3, \\\"web\\\": 1, \\\"wikipedia\\\": 1, \\\"c\\\\u1ef1u\\\": 1, \\\"th\\\\u01b0\\\\u1edfng\\\": 1, \\\"usd\\\": 1, \\\"m\\\\u00f9\\\": 7, \\\"heuristics\\\": 4, \\\"s\\\\u00e1t\\\": 62, \\\"th\\\\u1ecfa\\\": 10, \\\"mong\\\": 4, \\\"mu\\\\u1ed1n\\\": 7, \\\"s\\\\u1eafp\\\": 14, \\\"x\\\\u1ebfp\\\": 18, \\\"th\\\\u00eam\\\": 54, \\\"s\\\\u1edbm\\\": 6, \\\"r\\\\u1eddi\\\": 20, \\\"r\\\\u1ea1c\\\": 19, \\\"kh\\\\u00eda\\\": 1, \\\"khi\\\\u1ebfn\\\": 3, \\\"c\\\\u00f4n\\\": 1, \\\"\\\\u0111\\\\u1ee9ng\\\": 5, \\\"b\\\\u1ea7y\\\": 4, \\\"retrieval\\\": 1, \\\"search\\\": 23, \\\"engine\\\": 1, \\\"bing\\\": 1, \\\"x\\\\u00e2u\\\": 2, \\\"k\\\": 52, \\\"l\\\\u00e1ng\\\": 22, \\\"gi\\\\u1ec1ng\\\": 22, \\\"t\\\\u00f9y\\\": 12, \\\"q\\\": 95, \\\"r\\\\u1ed7ng\\\": 10, \\\"g\\\": 74, \\\"\\\\u2286\\\": 3, \\\"c\\\": 67, \\\"s\\\": 45, \\\"t\\\\u01b0\\\\u1eddng\\\": 8, \\\"chi\\\\u1ebfu\\\": 1, \\\"h\\\\u1ebft\\\": 15, \\\"\\\\u00e1nh\\\": 12, \\\"p\\\": 220, \\\"q\\\\u2192q\\\": 1, \\\"n\\\": 183, \\\"x\\\\u00f3m\\\": 27, \\\"x\\\": 216, \\\"\\\\u2192\\\": 5, \\\"r\\\": 14, \\\"n\\\\u00fat\\\": 359, \\\"m\\\\u1ed1i\\\": 3, \\\"th\\\\u1ea5p\\\": 4, \\\"li\\\\u1ec7t\\\": 13, \\\"l\\\\u00e1\\\": 14, \\\"bi\\\\u00ean\\\": 28, \\\"o\\\": 102, \\\"l\\\\u1eb7p\\\": 53, \\\"bi\\\\u1ec7n\\\": 1, \\\"4\\\": 16, \\\"\\\\u2190\\\": 23, \\\"while\\\": 14, \\\"\\\\u2260\\\": 7, \\\"\\\\u00f8\\\": 5, \\\"\\\\u2208\\\": 13, \\\"x\\\\u00f3a\\\": 5, \\\"if\\\": 15, \\\"return\\\": 22, \\\"n\\\\u1eb1m\\\": 22, \\\"duy\\\\u1ec7t\\\": 6, \\\"chi\\\\u1ec1u\\\": 60, \\\"graph\\\": 6, \\\"danh\\\": 26, \\\"d\\\": 55, \\\"b\\\\u1ed1n\\\": 2, \\\"\\\\u0111\\\\u1ed3\\\": 18, \\\"r\\\\u1ebd\\\": 6, \\\"b\\\": 135, \\\"cha\\\": 41, \\\"n\\\\u00f4ng\\\": 6, \\\"m\\\": 51, \\\"blind\\\": 1, \\\"uninformed\\\": 1, \\\"c\\\\u0103n\\\": 2, \\\"breadth\\\": 1, \\\"first\\\": 2, \\\"bfs\\\": 3, \\\"v\\\\u00e9t\\\": 3, \\\"0\\\": 52, \\\"r\\\\u1ed3i\\\": 1, \\\"d\\\\u1ec5\\\": 15, \\\"d\\\\u00e0ng\\\": 7, \\\"\\\\u0111\\\\u1ee3i\\\": 3, \\\"fifo\\\": 2, \\\"tr\\\\u1ecf\\\": 5, \\\"ghi\\\": 4, \\\"v\\\\u1eeba\\\": 14, \\\"c\\\\u00e0i\\\": 2, \\\"tr\\\\u1eeb\\\": 44, \\\"bd\\\": 4, \\\"nh\\\\u01b0\\\\u1ee3c\\\": 14, \\\"ch\\\\u1edd\\\": 1, \\\"xong\\\": 3, \\\"c\\\\u1eb7p\\\": 5, \\\"uniform\\\": 1, \\\"cost\\\": 2, \\\"dijkstra\\\": 3, \\\"lu\\\\u00f4n\\\": 15, \\\"depth\\\": 1, \\\"x0002\\\": 2, \\\"dfs\\\": 7, \\\"ng\\\\u0103n\\\": 6, \\\"lifo\\\": 3, \\\"\\\\u0111\\\\u1ec7\\\": 8, \\\"quay\\\": 1, \\\"lui\\\": 1, \\\"\\\\u0111\\\\u00edchc\\\": 1, \\\"o\\\\u2190s\\\": 3, \\\"x\\\\u1ea5u\\\": 6, \\\"bm\\\": 2, \\\"iterative\\\": 4, \\\"deepening\\\": 2, \\\"ids\\\": 2, \\\"ch\\\\u1eadm\\\": 4, \\\"b\\\\u1ebf\\\": 1, \\\"t\\\\u1eadn\\\": 2, \\\"then\\\": 10, \\\"\\\\u2022\\\": 30, \\\"s\\\\u1ebdt\\\\u00ecm\\\": 1, \\\"l\\\\u00e3ng\\\": 2, \\\"bidirectional\\\": 2, \\\"g\\\\u00e2y\\\": 4, \\\"t\\\\u1ed1n\\\": 2, \\\"l\\\\u01b0\\\\u1ee3t\\\": 8, \\\"nhan\\\": 1, \\\"informed\\\": 1, \\\"m\\\\u1ecf\\\": 1, \\\"mau\\\": 2, \\\"k\\\\u00fd\\\": 75, \\\"h\\\": 63, \\\"\\\\u22650\\\": 1, \\\"vai\\\": 9, \\\"ph\\\\u00eda\\\": 10, \\\"\\\\u2264\\\": 6, \\\"node\\\": 3, \\\"h1\\\": 4, \\\"h2\\\": 4, \\\"tr\\\\u1ed9i\\\": 3, \\\"h\\\\u2019\\\": 2, \\\"max\\\": 2, \\\"n\\\\u1edbi\\\": 1, \\\"l\\\\u1ecfng\\\": 1, \\\"f\\\": 57, \\\"\\\\u201ct\\\\u1ed1t\\\\u201d\\\": 1, \\\"ti\\\\u1ec1m\\\": 1, \\\"lam\\\": 17, \\\"greedy\\\": 1, \\\"tr\\\\u00f4ng\\\": 3, \\\"v\\\\u1ebb\\\": 2, \\\"\\\\u201ctham\\\": 1, \\\"lam\\\\u201d\\\": 1, \\\"g\\\\u1eafng\\\": 4, \\\"sai\\\": 37, \\\"qu\\\\u00e3ng\\\": 1, \\\"admissible\\\": 1, \\\"i\\\": 49, \\\"ii\\\": 4, \\\"iii\\\": 3, \\\"phi\\\\u00ean\\\": 12, \\\"gi\\\\u1eef\\\": 4, \\\"\\\\u00edt\\\": 22, \\\"m\\\\u0169\\\": 6, \\\"l\\\\u1ec7\\\": 23, \\\"tuy\\\\u1ebfn\\\": 32, \\\"ng\\\\u01b0\\\\u1ee1ng\\\": 10, \\\"\\\\u03b1\\\": 30, \\\"2\\\\u03b1\\\": 2, \\\"3\\\\u03b1\\\": 1, \\\"d\\\\u1eebng\\\": 12, \\\"\\\\u03b2\\\": 30, \\\"saudan\\\": 1, \\\"local\\\": 2, \\\"improvement\\\": 2, \\\"obj\\\": 15, \\\"\\\\u20131\\\": 1, \\\"tr\\\\u1ee5c\\\": 3, \\\"ho\\\\u00e0nh\\\": 1, \\\"leo\\\": 33, \\\"\\\\u0111\\\\u1ed3i\\\": 33, \\\"hill\\\": 3, \\\"climbing\\\": 3, \\\"\\\\u0111\\\\u1ec9nh\\\": 5, \\\"best\\\": 1, \\\"ng\\\\u1eabu\\\": 64, \\\"\\\\u2200yi\\\": 1, \\\"yi\\\": 16, \\\"argmaxi\\\": 1, \\\"go\\\": 2, \\\"tr\\\\u00e1ng\\\": 1, \\\"\\\\u201c\\\\u0111\\\\u1ed3i\\\\u201d\\\": 1, \\\"\\\\u201ch\\\\u1ed1\\\\u201d\\\": 1, \\\"stochastic\\\": 2, \\\"\\\\u201cki\\\\u00ean\\\": 1, \\\"nh\\\\u1eabn\\\\u201d\\\": 1, \\\"ki\\\\u00ean\\\": 4, \\\"nh\\\\u1eabn\\\": 2, \\\"yi\\\\u2208y\\\": 1, \\\"kh\\\\u00e1\\\": 8, \\\"\\\\u201c\\\\u0111i\\\": 1, \\\"xu\\\\u1ed1ng\\\\u201d\\\": 1, \\\"tho\\\\u00e1t\\\": 1, \\\"random\\\": 1, \\\"walk\\\": 1, \\\"t\\\\u00f4i\\\": 7, \\\"th\\\\u00e9p\\\": 7, \\\"simulated\\\": 1, \\\"annealing\\\": 1, \\\"ngh\\\\u1ecbch\\\": 2, \\\"\\\\u03b4\\\": 5, \\\"s\\\\u01a1\\\": 4, \\\"else\\\": 2, \\\"e\\\": 85, \\\"t\\\": 15, \\\"rand\\\": 1, \\\"x\\\\u00e9\\\": 1, \\\"b\\\\u1ec1n\\\": 1, \\\"n\\\\u00f3ng\\\": 1, \\\"linh\\\": 1, \\\"nhi\\\\u1ec7t\\\": 2, \\\"\\\\u1ed5n\\\": 2, \\\"r\\\\u1eafn\\\": 1, \\\"genetic\\\": 1, \\\"algorithm\\\": 1, \\\"charles\\\": 1, \\\"darwin\\\": 1, \\\"evolutionary\\\": 1, \\\"algorithms\\\": 1, \\\"trao\\\": 3, \\\"c\\\\u00e1\\\": 59, \\\"chi\\\\u1ebfm\\\": 3, \\\"s\\\\u1eafc\\\": 15, \\\"gen\\\": 24, \\\"fitness\\\": 1, \\\"b\\\\u1eadc\\\": 6, \\\"m\\\\u1eb9\\\": 45, \\\"du\\\\u1ec7\\\": 4, \\\"vec\\\": 13, \\\"t\\\\u1edd\\\": 1, \\\"nh\\\\u1ecb\\\": 14, \\\"qu\\\\u1ea7n\\\": 18, \\\"gh\\\\u00e9p\\\": 20, \\\"b\\\\u00ecnh\\\": 23, \\\"t\\\\u1ee5\\\": 4, \\\"selection\\\": 3, \\\"crossover\\\": 1, \\\"ch\\\\u00e9o\\\": 19, \\\"t\\\\u00e1i\\\": 1, \\\"\\\\u0111u\\\\u00f4i\\\": 1, \\\"mutation\\\": 1, \\\"ga\\\": 1, \\\"\\\\u23a3n\\\": 1, \\\"2\\\\u23a6\\\": 1, \\\"tu\\\\u1ef3\\\": 1, \\\"ch\\\\u1ed7\\\": 2, \\\"iv\\\": 1, \\\"g\\\\u2019\\\": 4, \\\"b\\\\u00e1nh\\\": 7, \\\"ru\\\": 5, \\\"let\\\": 3, \\\"s\\\\u00f2ng\\\": 1, \\\"b\\\\u1ea1c\\\": 1, \\\"\\\\u2211f\\\": 1, \\\"l\\\\u00e9t\\\": 2, \\\"elitism\\\": 1, \\\"m\\\\u1ea5t\\\": 3, \\\"100\\\": 4, \\\"c\\\\u0169\\\": 1, \\\"bit\\\": 3, \\\"ho\\\\u00e1n\\\": 3, \\\"ch\\\\u00e9p\\\": 1, \\\"ch\\\\u1ee9\\\": 4, \\\"th\\\\u01b0\\\\u1eddn\\\": 1, \\\"tabu\\\": 4, \\\"list\\\": 1, \\\"t\\\\u1ea1m\\\": 2, \\\"c\\\\u1ea5m\\\": 3, \\\"\\\\u0111\\\\u1ea9y\\\": 1, \\\"ch\\\\u00f9m\\\": 6, \\\"beam\\\": 1, \\\"ch\\\\u00f3ng\\\": 1, \\\"\\\\u0111\\\\u00e0n\\\": 9, \\\"ant\\\": 1, \\\"colony\\\": 1, \\\"optimization\\\": 2, \\\"marco\\\": 1, \\\"dorigo\\\": 1, \\\"\\\\u0103n\\\": 3, \\\"pheromone\\\": 5, \\\"d\\\\u1ebbo\\\": 2, \\\"b\\\\u1ed5\\\": 2, \\\"sung\\\": 2, \\\"knowledge\\\": 2, \\\"base\\\": 2, \\\"kb\\\": 51, \\\"inference\\\": 2, \\\"deduction\\\": 1, \\\"frame\\\": 1, \\\"n\\\\u1ebfu\\\\u2026th\\\\u00ec\\\": 1, \\\"ontology\\\": 1, \\\"s\\\\u1ee9c\\\": 1, \\\"g\\\\u1ecdn\\\": 12, \\\"true\\\": 22, \\\"false\\\": 17, \\\"m\\\\u1ec7nh\\\": 45, \\\"\\\\u2212\\\": 10, \\\"ch\\\\u00e2n\\\": 15, \\\"h\\\\u1eb1ng\\\": 16, \\\"\\\\u2227\\\": 38, \\\"\\\\u2228\\\": 50, \\\"\\\\u00ac\\\": 48, \\\"\\\\u21d2\\\": 9, \\\"\\\\u21d4\\\": 4, \\\"d\\\\u1ea5u\\\": 13, \\\"ngo\\\\u1eb7c\\\": 7, \\\"\\\\u201c\\\": 8, \\\"a\\\\u2228b\\\": 2, \\\"\\\\u2227c\\\": 2, \\\"literal\\\": 23, \\\"d\\\\u01b0\\\\u01a1ng\\\": 25, \\\"a1\\\\u2228\\\": 1, \\\"\\\\u2228am\\\": 1, \\\"tuy\\\\u1ec3n\\\": 18, \\\"clause\\\": 10, \\\"\\\\u201ch\\\\u00e0\\\": 2, \\\"nam\\\\u201d\\\": 2, \\\"k\\\\u00ec\\\": 1, \\\"\\\\u201cvoi\\\": 1, \\\"c\\\\u1ea7m\\\\u201d\\\": 1, \\\"h\\\\u1ecda\\\": 19, \\\"a\\\\u2190true\\\": 1, \\\"a\\\\u2190false\\\": 1, \\\"b\\\\u1ea3ng\\\": 34, \\\"\\\\u2261\\\": 23, \\\"k\\\\u00e9p\\\": 2, \\\"de\\\": 2, \\\"morgan\\\": 2, \\\"a\\\\u2228\\\": 1, \\\"\\\\u201ct\\\\u1ea5t\\\": 1, \\\"ch\\\\u0103m\\\": 9, \\\"h\\\\u1ecdc\\\\u201d\\\": 1, \\\"b\\\\u00e0n\\\": 2, \\\"g\\\\u1ed7\\\": 3, \\\"g\\\\u1ea7y\\\\u2026\\\": 1, \\\"em\\\": 6, \\\"b\\\\u00e8\\\": 1, \\\"b\\\\u1ed9i\\\": 1, \\\"phong\\\": 6, \\\"ok\\\\u00fd\\\": 1, \\\"oc\\\\u00e1c\\\": 7, \\\"h\\\\u1ea1\\\": 1, \\\"long\\\": 1, \\\"z\\\": 12, \\\"b\\\\u1eafc\\\": 2, \\\"t\\\\u1ee7\\\": 1, \\\"\\\\u00fat\\\": 1, \\\"min\\\": 1, \\\"9\\\": 3, \\\"\\\\u2200\\\": 9, \\\"\\\\u2203\\\": 7, \\\"ph\\\\u1ea9y\\\": 1, \\\"n\\\\u22650\\\": 1, \\\"n\\\\u22651\\\": 1, \\\"\\\\u0111\\\\u1eafn\\\": 11, \\\"h\\\\u1ea1ng\\\": 25, \\\"term\\\": 2, \\\"t1\\\": 3, \\\"t2\\\": 2, \\\"t3\\\": 1, \\\"tn\\\": 6, \\\"ground\\\": 1, \\\"\\\\u0111\\\\u1ee9c\\\": 2, \\\"b\\\\u00e0\\\": 2, \\\"d\\\\u0169\\\": 2, \\\"v\\\\u1ebf\\\": 11, \\\"b\\\\u1edbi\\\": 2, \\\"g\\\\u21d2\\\": 1, \\\"g\\\\u21d4h\\\": 1, \\\"gh\\\\u00e9t\\\": 1, \\\"d\\\\u0169ng\\\": 2, \\\"voi\\\": 4, \\\"x\\\\u00e1m\\\": 3, \\\"m\\\\u00e0u\\\": 2, \\\"x\\\\u00e1m\\\\u201d\\\": 1, \\\"\\\\u2200x\\\": 21, \\\"\\\\u201cv\\\\u00e0\\\\u201d\\\": 3, \\\"p308\\\": 2, \\\"308\\\": 1, \\\"308\\\\u201d\\\": 1, \\\"\\\\u2203x\\\": 11, \\\"\\\\u201ck\\\\u00e9o\\\": 1, \\\"theo\\\\u201d\\\": 1, \\\"kh\\\\u1eb3ng\\\": 1, \\\"kem\\\": 4, \\\"\\\\u00ac\\\\u2203x\\\": 1, \\\"\\\\u00acth\\\\u00edch\\\": 2, \\\"\\\\u2203y\\\": 7, \\\"\\\\u00ac\\\\u2200x\\\": 1, \\\"l\\\\u1ed3ng\\\": 1, \\\"\\\\u2200x\\\\u2200y\\\": 1, \\\"\\\\u0111\\\\u1ea5y\\\": 1, \\\"nh\\\\u1ea7m\\\": 1, \\\"l\\\\u1eabn\\\": 2, \\\"b\\\\u00f3ng\\\": 2, \\\"\\\\u0111\\\\u00e1\\\": 2, \\\"lan\\\": 2, \\\"h\\\\u1ed3ng\\\": 1, \\\"\\\\u00f4ng\\\": 1, \\\"\\\\u2200y\\\": 2, \\\"g1\\\": 2, \\\"gm\\\": 2, \\\"r\\\\u00fat\\\": 4, \\\"sound\\\": 1, \\\"complete\\\": 1, \\\"k\\\\u00ed\\\": 1, \\\"\\\\u255e\\\": 2, \\\"\\\\u251ci\\\": 1, \\\"hi\\\\u1ec3n\\\": 1, \\\"cook\\\": 1, \\\"1971\\\": 1, \\\"np\\\": 4, \\\"modus\\\": 8, \\\"ponens\\\": 7, \\\"tollens\\\": 1, \\\"c\\\\u1eady\\\": 2, \\\"forward\\\": 2, \\\"chaining\\\": 2, \\\"l\\\\u00f9i\\\": 16, \\\"backward\\\": 3, \\\"resolution\\\": 1, \\\"refutation\\\": 1, \\\"\\\\u03b8\\\": 16, \\\"v1\\\": 12, \\\"vn\\\": 14, \\\"ti\\\": 2, \\\"subst\\\": 6, \\\"universal\\\": 1, \\\"elimination\\\": 3, \\\"existential\\\": 2, \\\"skolem\\\": 11, \\\"introduction\\\": 1, \\\"unify\\\": 2, \\\"unifier\\\": 2, \\\"mgu\\\": 1, \\\"most\\\": 1, \\\"t\\\\u1ec9\\\": 1, \\\"pi\\\": 6, \\\"pi\\\\u2019\\\": 2, \\\"ikhi\\\": 1, \\\"p1\\\\u2019\\\": 1, \\\"p2\\\\u2019\\\": 1, \\\"p3\\\\u2019\\\": 1, \\\"pn\\\\u2019\\\": 1, \\\"p1\\\\u2227\\\": 1, \\\"p2\\\": 4, \\\"\\\\u2227\\\\u2026\\\": 2, \\\"pn\\\": 6, \\\"gmp\\\": 3, \\\"horn\\\": 19, \\\"alfred\\\": 1, \\\"p1\\\": 6, \\\"definite\\\": 2, \\\"fact\\\": 1, \\\"chi\\\\u1ec3u\\\": 1, \\\"q\\\\u2019\\\": 2, \\\"p2\\\\u2228\\\": 2, \\\"q1\\\": 3, \\\"q2\\\\u2228\\\": 2, \\\"qm\\\": 3, \\\"qi\\\": 1, \\\"pj\\\": 3, \\\"qk\\\": 3, \\\"1\\\\u2228\\\": 4, \\\"\\\\u2026\\\\u2228\\\": 1, \\\"conjunctive\\\": 1, \\\"normal\\\": 1, \\\"form\\\": 3, \\\"cnf\\\": 4, \\\"\\\\u251c\\\": 3, \\\"union\\\": 1, \\\"s1\\\": 2, \\\"s2\\\": 2, \\\"kh\\\\u1eed\\\": 2, \\\"7\\\": 1, \\\"8\\\": 1, \\\"p\\\\u21d4q\\\": 1, \\\"p\\\\u21d2q\\\": 1, \\\"p\\\\u2227q\\\": 1, \\\"p\\\\u2228\\\": 1, \\\"p\\\\u2227\\\\u00ac\\\": 1, \\\"\\\\u201cy\\\": 1, \\\"x\\\\u201d\\\": 1, \\\"\\\\u201cv\\\\u1edbi\\\": 1, \\\"h\\\\u01a1n\\\\u201d\\\": 1, \\\"r\\\\u2228\\\": 1, \\\"\\\\u2228\\\\u00ac\\\": 1, \\\"\\\\u0111\\\\u1ef1ng\\\": 1, \\\"ng\\\\u1ef1a\\\": 1, \\\"ch\\\\u1ea5n\\\": 1, \\\"under\\\": 1, \\\"uncertainty\\\": 1, \\\"\\\\u201c\\\\u0111\\\\u00fang\\\\u201d\\\": 4, \\\"\\\\u201csai\\\\u201d\\\": 3, \\\"\\\\u201ckh\\\\u00f4ng\\\": 1, \\\"sai\\\\u201d\\\": 1, \\\"m\\\\u1edd\\\": 2, \\\"fuzzy\\\": 1, \\\"possibility\\\": 1, \\\"ni\\\\u1ec1m\\\": 8, \\\"tu\\\\u00e2n\\\": 1, \\\"tr\\\\u1eddi\\\": 3, \\\"m\\\\u01b0a\\\": 2, \\\"l\\\\u1ec5\\\": 1, \\\"venn\\\": 1, \\\"\\\\u00aca\\\": 2, \\\"\\\\u00acb\\\": 2, \\\"\\\\u03c3a\\\": 1, \\\"bi\\\\u1ec5n\\\": 1, \\\"v2\\\": 6, \\\"\\\\u2211\\\": 15, \\\"d\\\\u00f2ng\\\": 11, \\\"qui\\\": 2, \\\"bayes\\\": 61, \\\"vk\\\": 10, \\\"m\\\\u00f4n\\\": 1, \\\"nhu\\\\u1eadn\\\": 2, \\\"x\\\\u1ee9ng\\\": 1, \\\"chu\\\": 2, \\\"x1\\\": 19, \\\"xn\\\": 13, \\\"x2\\\": 8, \\\"\\\\u2227\\\\u2026\\\\u2227\\\": 1, \\\"\\\\u220fp\\\": 2, \\\"xi\\\": 81, \\\"me\\\": 3, \\\"v\\\\u1ec1b\\\\u00e0i\\\": 1, \\\"\\\\u0111i\\\\u1ec1n\\\": 1, \\\"t\\\\u1ea7n\\\": 7, \\\"b1\\\": 1, \\\"b2\\\": 1, \\\"t\\\\u1ef1sau\\\": 1, \\\"b3\\\": 1, \\\"the\\\": 1, \\\"d\\\\u01b0ng\\\": 1, \\\"v\\\\u1ec3\\\": 1, \\\"\\\\u201cd\\\": 1, \\\"\\\\u201cdirectional\\\\u201d\\\": 1, \\\"\\\\u201cc\\\\u00f3\\\": 1, \\\"h\\\\u01b0\\\\u1edbng\\\\u201d\\\": 1, \\\"t\\\\u1ecfa\\\": 6, \\\"li\\\\u1ec1n\\\": 2, \\\"k\\\\u1ec1\\\": 1, \\\"ss\\\": 1, \\\"tr\\\\u1eb7c\\\": 2, \\\"e1\\\": 3, \\\"en\\\": 3, \\\"\\\\u201c\\\\u0111au\\\": 2, \\\"\\\\u0111\\\\u1ea7u\\\\u201d\\\": 2, \\\"\\\\u201cch\\\\u00e1n\\\": 2, \\\"\\\\u0103n\\\\u201d\\\": 2, \\\"bool\\\": 1, \\\"\\\\u201cnh\\\\u1eb9\\\\u201d\\\": 1, \\\"\\\\u201cd\\\\u1eef\\\": 1, \\\"d\\\\u1ed9i\\\\u201d\\\": 1, \\\"\\\\u201ckh\\\\u00f4ng\\\\u201d\\\": 1, \\\"ch\\\\u00e1n\\\": 1, \\\"\\\\u0111au\\\": 1, \\\"d\\\\u1ed9i\\\": 1, \\\"15\\\": 1, \\\"l\\\": 7, \\\"\\\\u00acl\\\": 1, \\\"exact\\\": 1, \\\"enumeration\\\": 1, \\\"h\\\\u1ea7u\\\": 3, \\\"n2n\\\": 1, \\\"2n\\\": 2, \\\"x\\\\u1ea5p\\\": 9, \\\"x\\\\u1ec9\\\": 9, \\\"propagation\\\": 1, \\\"xp\\\": 6, \\\"\\\\u0111\\\\u1ebfm\\\": 2, \\\"nc\\\": 21, \\\"ns\\\": 8, \\\"b\\\\u00f9\\\": 1, \\\"input\\\": 5, \\\"w\\\\u21901\\\": 1, \\\"w\\\": 15, \\\"endif\\\": 1, \\\"b\\\\u1eb3ng\\\": 1, \\\"\\\\u201cl\\\\u1ea5y\\\": 1, \\\"s\\\\u1ed1\\\\u201d\\\": 1, \\\"goto\\\": 1, \\\"th\\\\u1eeba\\\": 37, \\\"variable\\\": 1, \\\"th\\\\u00e1c\\\": 1, \\\"ma\\\": 3, \\\"tr\\\\u1eadn\\\": 3, \\\"2x1\\\": 1, \\\"2x2\\\": 1, \\\"\\\\u201clo\\\\u1ea1i\\\": 1, \\\"bi\\\\u1ebfn\\\\u201d\\\": 1, \\\"xm\\\": 1, \\\"f2\\\": 4, \\\"fn\\\": 6, \\\"eliminate\\\": 3, \\\"output\\\": 3, \\\"f1\\\": 1, \\\"fk\\\": 2, \\\"\\\\u2211g\\\": 1, \\\"b\\\\u00e2y\\\": 1, \\\"ve\\\": 1, \\\"\\\\u2118\\\": 4, \\\"end\\\": 1, \\\"\\\\u2211h\\\": 1, \\\"ngay\\\": 5, \\\"polytree\\\": 3, \\\"pathfinder\\\": 1, \\\"office\\\": 1, \\\"assistant\\\": 1, \\\"clippy\\\": 1, \\\"protein\\\": 1, \\\"troubleshooting\\\": 3, \\\"windows\\\": 1, \\\"h\\\\u1ecfng\\\": 2, \\\"h\\\\u00f3c\\\": 2, \\\"mua\\\": 7, \\\"s\\\\u1eafm\\\": 1, \\\"tu\\\\u1ed5i\\\": 1, \\\"tr\\\\u1eef\\\": 1, \\\"h\\\\u00fat\\\": 1, \\\"\\\\u201cnh\\\\u1eefng\\\": 1, \\\"m\\\\u00ec\\\": 1, \\\"b\\\\u01a1\\\\u201d\\\": 1, \\\"\\\\u201cth\\\\u01b0\\\": 6, \\\"r\\\\u00e1c\\\\u201d\\\": 3, \\\"th\\\\u01b0\\\\u1eddng\\\\u201d\\\": 5, \\\"\\\\u201cx\\\\u00e3\\\": 2, \\\"h\\\\u1ed9i\\\\u201d\\\": 2, \\\"\\\\u201ckinh\\\": 1, \\\"t\\\\u1ebf\\\\u201d\\\": 1, \\\"\\\\u201cth\\\\u1ec3\\\": 2, \\\"thao\\\\u201d\\\": 2, \\\"translate\\\": 1, \\\"m\\\\u1eafc\\\": 2, \\\"kho\\\\u00e1n\\\": 1, \\\"v\\\\u00e0ng\\\": 1, \\\"phim\\\": 1, \\\"\\\\u00f4t\\\\u00f4\\\": 1, \\\"supervised\\\": 2, \\\"classification\\\": 1, \\\"regression\\\": 2, \\\"un\\\": 1, \\\"clustering\\\": 1, \\\"association\\\": 1, \\\"rule\\\": 1, \\\"b\\\\u01a1\\\": 2, \\\"m\\\\u1ef3\\\": 2, \\\"80\\\": 2, \\\"reinforcement\\\": 1, \\\"kh\\\\u00edch\\\": 2, \\\"reward\\\": 1, \\\"khuy\\\\u1ec3n\\\": 1, \\\"n\\\\u1eb7ng\\\": 2, \\\"huy\\\\u1ebft\\\": 1, \\\"\\\\u201cr\\\\u00e1c\\\\u201d\\\": 2, \\\"\\\\u201cb\\\\u00ecnh\\\": 1, \\\"target\\\": 1, \\\"function\\\": 6, \\\"positive\\\": 2, \\\"tp\\\": 9, \\\"negative\\\": 2, \\\"fp\\\": 7, \\\"error\\\": 5, \\\"accuracy\\\": 4, \\\"rate\\\": 5, \\\"precision\\\": 9, \\\"p\\\\u2019\\\": 2, \\\"recall\\\": 8, \\\"measure\\\": 1, \\\"nh\\\\u1eady\\\": 1, \\\"sensitivity\\\": 2, \\\"specificity\\\": 2, \\\"email\\\": 1, \\\"g\\\\u1ed9p\\\": 2, \\\"mae\\\": 4, \\\"mean\\\": 2, \\\"absolute\\\": 1, \\\"mse\\\": 4, \\\"squared\\\": 1, \\\"tring\\\": 1, \\\"fi\\\": 6, \\\"nh\\\\u1ea5n\\\": 2, \\\"ch\\\\u00eanh\\\": 6, \\\"l\\\\u1ec7ch\\\": 9, \\\"cross\\\": 5, \\\"validation\\\": 5, \\\"hold\\\": 1, \\\"out\\\": 2, \\\"shl\\\": 4, \\\"skt\\\": 4, \\\"70\\\": 2, \\\"30\\\": 2, \\\"hi\\\": 2, \\\"fold\\\": 6, \\\"sk\\\": 1, \\\"si\\\": 8, \\\"leave\\\": 1, \\\"loocv\\\": 1, \\\"d\\\\u00e0nh\\\": 2, \\\"feature\\\": 3, \\\"filtering\\\": 2, \\\"wrapper\\\": 3, \\\"mi\\\": 7, \\\"mutual\\\": 1, \\\"log\\\": 2, \\\"values\\\": 3, \\\"nhi\\\\u00eau\\\": 1, \\\"b\\\\u1ecdc\\\": 4, \\\"\\\\u2205\\\": 1, \\\"v\\\\u2026v\\\": 1, \\\"g\\\\u00f4c\\\": 1, \\\"\\\\u201ch\\\\u1ecdc\\\\u201d\\\": 1, \\\"id3\\\": 9, \\\"dichotomiser\\\": 1, \\\"tu\\\\u1ea7n\\\": 1, \\\"ross\\\": 1, \\\"quinlan\\\": 1, \\\"c4\\\": 2, \\\"v\\\\u00e9c\\\": 2, \\\"nhi\\\\u1ec5u\\\": 5, \\\"entropy\\\": 16, \\\"log2p\\\": 2, \\\"pc\\\": 1, \\\"log2\\\": 2, \\\"log2c\\\": 1, \\\"nh\\\\u1ea5\\\": 1, \\\"gain\\\": 2, \\\"ig\\\": 11, \\\"sv\\\": 6, \\\"khuynh\\\": 3, \\\"occam\\\\u2019s\\\": 1, \\\"razor\\\": 1, \\\"occam\\\": 1, \\\"overfitting\\\": 2, \\\"t\\\\u2019\\\": 3, \\\"\\\\u201ct\\\\u1ec9a\\\\u201d\\\": 1, \\\"ch\\\\u1ed1ng\\\": 2, \\\"t\\\\u1ec9a\\\": 23, \\\"\\\\u201cn\\\\u1ebfu\\\": 1, \\\"n\\\\u1eafng\\\": 1, \\\"\\\\u1ea9m\\\": 1, \\\"ch\\\\u01a1i\\\\u201d\\\": 1, \\\"ac\\\": 4, \\\"th\\\\u0103ng\\\": 1, \\\"thu\\\\u1ea7n\\\": 1, \\\"t\\\\u00fay\\\": 1, \\\"ph\\\\u1ea1t\\\": 1, \\\"split\\\": 1, \\\"informatio\\\": 1, \\\"gr\\\": 5, \\\"ratio\\\": 1, \\\"na\\\\u00efve\\\": 1, \\\"cmap\\\": 1, \\\"map\\\": 1, \\\"maximum\\\": 2, \\\"posterior\\\": 1, \\\"cnb\\\": 2, \\\"argmaxp\\\": 1, \\\"cj\\\": 20, \\\"ph\\\\u1ea7np\\\": 1, \\\"tr\\\\u01a1n\\\": 4, \\\"xj\\\": 3, \\\"m\\\\u2192\\\": 1, \\\"\\\\u221e\\\": 2, \\\"\\\\u201cch\\\\u00ednh\\\": 1, \\\"tr\\\\u1ecb\\\\u201d\\\": 1, \\\"spamassassin\\\": 2, \\\"http\\\": 1, \\\"apache\\\": 1, \\\"org\\\": 1, \\\"\\\\u201ct\\\\u00fai\\\": 1, \\\"t\\\\u1eeb\\\\u201d\\\": 1, \\\"bag\\\": 1, \\\"word\\\": 1, \\\"t\\\\u00fai\\\": 2, \\\"\\\\u201cchia\\\": 1, \\\"\\\\u201cchia\\\\u201d\\\": 1, \\\"\\\\u201cth\\\\u01b0\\\\u201d\\\": 1, \\\"\\\\u201cth\\\\u00e0nh\\\\u201d\\\": 1, \\\"\\\\u201cth\\\\u01b0\\\\u1eddng\\\\u201d\\\": 1, \\\"s\\\\u00e1u\\\": 1, \\\"98\\\": 1, \\\"l\\\\u01b0\\\\u1eddi\\\": 1, \\\"lazy\\\": 1, \\\"based\\\": 2, \\\"nearest\\\": 2, \\\"neighbor\\\": 1, \\\"nn\\\": 6, \\\"case\\\": 1, \\\"nh\\\\u1ee9ng\\\": 1, \\\"\\\\u01a1clit\\\": 2, \\\"\\\\u00e2y\\\": 1, \\\"neighbors\\\": 1, \\\"knn\\\": 1, \\\"\\\\u01a1\\\": 5, \\\"clit\\\": 5, \\\"a1\\\": 2, 